app/controllers/users_controller.rb

INSERT INTO `users` (`authentication_token`, `authentication_token_updated_at`, `created_at`, `email`, `password`, `role`, `state`, `updated_at`) VALUES ('ypUxE7RaJZtHpexz7uLi', '2014-05-12 09:19:24', '2014-05-12 09:19:24', 'test@test.com', '$2a$10$a5MzlG7gd5.s6hlchV7rOOL4.ZUIJhplKUMx20r2o9O8acUDwmFhu', 'user', 'pending', '2014-05-12 09:19:24')
---
  def create
    @user = User.create!(user_params)